ErpTest/src/Documents/уатСливГСМ/уатСливГСМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>уатСливГСМ</name>
  <basedOn>Document.уатПутевойЛист</basedOn>
  <basedOn>Document.уатИнвентаризацияГСМвТС</basedOn>
  <registerRecords>AccumulationRegister.уатОстаткиГСМнаТС</registerRecords>
  <attributes>
    <name>АЗС</name>
    <type>
      <types>CatalogRef.ТранспортныеСредства</types>
      <types>CatalogRef.уатАЗС</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.уатВидыОперацийСливГСМ</types>
    </type>
  </attributes>
  <attributes>
    <name>ГСМ</name>
    <comment>ГСМ</comment>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <comment>Документ, на основании которого введен данный</comment>
    <type>
      <types>DocumentRef.уатИнвентаризацияГСМвТС</types>
      <types>DocumentRef.уатПутевойЛист</types>
    </type>
  </attributes>
  <attributes>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>(Общ) Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПутевойЛист</name>
    <type>
      <types>DocumentRef.уатПутевойЛист</types>
    </type>
  </attributes>
  <attributes>
    <name>ТС</name>
    <comment>ТС или оборудование</comment>
    <type>
      <types>CatalogRef.ТранспортныеСредства</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>ПутевойЛистПриемник</name>
    <type>
      <types>DocumentRef.уатПутевойЛист</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ErpTest/src/AccumulationRegisters/уатОстаткиГСМнаТС/уатОстаткиГСМнаТС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>уатОстаткиГСМнаТС</name>
  <comment>(уат)</comment>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Стоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтоимостьУпр</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ГСМ</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Колонна</name>
    <type>
      <types>CatalogRef.уатКолонны</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Партия</name>
    <type>
      <types>DocumentRef.уатВводОстатковГСМ</types>
      <types>DocumentRef.уатЗаправкаГСМ</types>
      <types>DocumentRef.уатСливГСМ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТС</name>
    <type>
      <types>CatalogRef.ТранспортныеСредства</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

ErpTest/src/Enums/уатВидыОперацийСливГСМ/уатВидыОперацийСливГСМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>уатВидыОперацийСливГСМ</name>
  <enumValues>
    <name>НаСклад</name>
    <comment>Слив ГСМ на склад</comment>
  </enumValues>
  <enumValues>
    <name>НаТС</name>
    <comment>Слив ГСМ на другое ТС</comment>
  </enumValues>
  <enumValues>
    <name>НаАЗС</name>
  </enumValues>
</mdclass:Enum>

ErpTest/src/Documents/уатСливГСМ/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ПРОВЕДЕНИЯ

// Инициализирует таблицы значений, содержащие данные табличных частей документа.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, СтруктураДополнительныеСвойства) Экспорт
	
	СформироватьТаблицаГСМ(ДокументСсылка, СтруктураДополнительныеСвойства);
		
КонецПроцедуры // ИнициализироватьДанныеДокумента()

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаГСМ(ДокументСсылка, СтруктураДополнительныеСвойства)
	Перем мТаблицаПоСписаниюГСМ;
	
	мЗапрос = новый Запрос;
	мЗапрос.Текст = 
	"ВЫБРАТЬ
	|	уатСливГСМ.ТС,
	|	уатСливГСМ.ГСМ
	|ИЗ
	|	Документ.уатСливГСМ КАК уатСливГСМ
	|ГДЕ
	|	уатСливГСМ.Ссылка = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	уатСливГСМ.АЗС,
	|	уатСливГСМ.ГСМ
	|ИЗ
	|	Документ.уатСливГСМ КАК уатСливГСМ
	|ГДЕ
	|	уатСливГСМ.АЗС ССЫЛКА Справочник.ТранспортныеСредства
	|	И уатСливГСМ.Ссылка = &Ссылка";

	мЗапрос.УстановитьПараметр("Ссылка",ДокументСсылка);
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.уатОстаткиГСМнаТС");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.ИсточникДанных = мЗапрос.Выполнить();
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("ТС" , "ТС");
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("ГСМ", "ГСМ");
	Блокировка.Заблокировать();
	
	ВсеОК =	уатОбщегоНазначения_проф.уатПодготовитьТаблицуСписанияГСМ(ДокументСсылка, мТаблицаПоСписаниюГСМ, Истина);
	
	мТаблицаПоСписаниюГСМ.Колонки.Добавить("Регистратор");
	мТаблицаПоСписаниюГСМ.ЗаполнитьЗначения(ДокументСсылка, "Регистратор");
	мТаблицаПоСписаниюГСМ.Колонки.Добавить("Период");
	ПериодРегистра = ДокументСсылка.Дата;
	Если ЗначениеЗаполнено(ДокументСсылка.ПутевойЛист) Тогда
		Если ДокументСсылка.Дата < ДокументСсылка.ПутевойЛист.ДатаВыезда Тогда
			ПериодРегистра = ДокументСсылка.ПутевойЛист.ДатаВыезда;
		ИначеЕсли ДокументСсылка.ПутевойЛист.ДатаВозвращения <> '00010101'
			И ДокументСсылка.ПутевойЛист.ДатаВозвращения > ДокументСсылка.ПутевойЛист.ДатаВыезда
			И ДокументСсылка.Дата > ДокументСсылка.ПутевойЛист.ДатаВозвращения Тогда
			ПериодРегистра = ДокументСсылка.ПутевойЛист.ДатаВозвращения;
		КонецЕсли;
	КонецЕсли;
	мТаблицаПоСписаниюГСМ.ЗаполнитьЗначения(ПериодРегистра, "Период");
	мТаблицаПоСписаниюГСМ.Колонки.Добавить("ВидДвижения");
	мТаблицаПоСписаниюГСМ.ЗаполнитьЗначения(ВидДвиженияНакопления.Расход, "ВидДвижения");
	
	// Дополним таблицу движениями в случае слива на другое ТС
	Если ДокументСсылка.ВидОперации = Перечисления.уатВидыОперацийСливГСМ.НаТС Тогда 
		врТаблЗаправкиТС = мТаблицаПоСписаниюГСМ.Скопировать(, "Дата, Регистратор, Период, ТС, ГСМ, Количество, Стоимость, СтоимостьУпр");
		врТаблЗаправкиТС.Свернуть("Дата, Регистратор, Период, ТС, ГСМ", "Количество, Стоимость, СтоимостьУпр");
		врТаблЗаправкиТС.Колонки.Добавить("ВидДвижения");
		врТаблЗаправкиТС.ЗаполнитьЗначения(ВидДвиженияНакопления.Приход, "ВидДвижения");
		врТаблЗаправкиТС.ЗаполнитьЗначения(ДокументСсылка.АЗС, "ТС");
		врТаблЗаправкиТС.Колонки.Добавить("Партия");
		врТаблЗаправкиТС.ЗаполнитьЗначения(ДокументСсылка.Ссылка, "Партия");
		
		Для Каждого СтрокаДополнения Из врТаблЗаправкиТС Цикл 
			НовСтрока = мТаблицаПоСписаниюГСМ.Добавить();
			ЗаполнитьЗначенияСвойств(НовСтрока, СтрокаДополнения);
		КонецЦикла;
	КонецЕсли;;
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаГСМ", мТаблицаПоСписаниюГСМ);
КонецПроцедуры // СформироватьТаблицаГСМ()

Процедура ВыполнитьКонтроль(ДокументСсылка, ДополнительныеСвойства, Отказ, УдалениеПроведения = Ложь) Экспорт
		
	Заголовок = уатОбщегоНазначенияТиповые.уатПредставлениеДокументаПриПроведении(ДокументСсылка);
	
	КоличествоОстаток = уатОбщегоНазначения.уатОстатокГСМнаТС(ДополнительныеСвойства.ДляПроведения.МоментКонтроля, ДокументСсылка.ТС, ДокументСсылка.ГСМ);
	Если КоличествоОстаток < 0 Тогда
		ТекстСообщения = "ГСМ """ + ДокументСсылка.ГСМ + """, ТС """ + уатОбщегоНазначения.уатПредставлениеТС(ДокументСсылка.ТС,
			ДокументСсылка.Организация) + """ ";
		ТекстСообщения = ТекстСообщения + " - отрицательный остаток ГСМ на ТС.";
		ТекстСообщения = ТекстСообщения + Символы.ПС + "Остаток на ТС: " + КоличествоОстаток + ".";
				
		уатОбщегоНазначенияТиповые.СообщитьОбОшибке(ТекстСообщения, Отказ, Заголовок);
	КонецЕсли;
		
	//проверим остатки без указания текущей даты
	Если КоличествоОстаток >= 0 Тогда
		КоличествоОстатокБезДаты = уатОбщегоНазначения.уатОстатокГСМнаТС(, ДокументСсылка.ТС, ДокументСсылка.ГСМ);
		Если КоличествоОстатокБезДаты < 0 Тогда
			ТекстСообщения = "ГСМ """ + ДокументСсылка.ГСМ + """, ТС """ + уатОбщегоНазначения.уатПредставлениеТС(ДокументСсылка.ТС,
			ДокументСсылка.Организация) + """ ";
			ТекстСообщения = ТекстСообщения + " - отрицательный остаток ГСМ на ТС.";
			ТекстСообщения = ТекстСообщения + Символы.ПС + "Остаток на ТС: " + КоличествоОстатокБезДаты + ".";
			
			уатОбщегоНазначенияТиповые.СообщитьОбОшибке(ТекстСообщения, Отказ, Заголовок);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// СтандартныеПодсистемы.ВерсионированиеОбъектов
// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт
	Заглушка = Истина;
КонецПроцедуры
// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ПЕЧАТИ

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Документ.уатСливГСМ";
	КомандаПечати.Идентификатор = "Слив";
	КомандаПечати.Представление = НСтр("ru = 'Слив ГСМ'");
	
КонецПроцедуры

// Процедура осуществляет печать документа. Можно направить печать на 
// экран или принтер, а также распечатать необходимое количество копий.
//
//  Название макета печати передается в качестве параметра,
// по переданному названию находим имя макета в соответствии.
//
// Параметры:
//  НазваниеМакета - строка, название макета.
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если НЕ уатОбщегоНазначенияСервер.РазрешениеПечатиНепроведенногоДокумента(МассивОбъектов) Тогда
		Возврат;
	КонецЕсли;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "Слив") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "Слив", "Слив ГСМ", ПечатьСлив(МассивОбъектов, ОбъектыПечати));
	КонецЕсли;
	
	уатОбщегоНазначенияСервер.УстановитьРедактированиеПечатныхФормДокумента(КоллекцияПечатныхФорм);
	
КонецПроцедуры

Функция ПечатьСлив(МассивОбъектов, ОбъектыПечати) 
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_СливГСМ_Слив";
	Макет       = УправлениеПечатью.МакетПечатнойФормы("Документ.уатСливГСМ.ПФ_MXL_Слив");
	
	ПервыйДокумент = Истина;
	
	Для Каждого ТекущийДокумент Из МассивОбъектов Цикл
		
		Если Не ПервыйДокумент Тогда
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		
		НомерСтрокиНачало = ТабДокумент.ВысотаТаблицы + 1;
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	уатСливГСМ.Организация,
		|	уатСливГСМ.Ответственный,
		|	уатСливГСМ.ТС,
		|	уатСливГСМ.ГСМ,
		|	уатСливГСМ.АЗС,
		|	уатСливГСМ.Количество,
		|	уатСливГСМ.ПутевойЛист
		|ИЗ
		|	Документ.уатСливГСМ КАК уатСливГСМ
		|ГДЕ
		|	уатСливГСМ.Ссылка = &Ссылка";
		
		Запрос.УстановитьПараметр("Ссылка", ТекущийДокумент.Ссылка);
		ТЗ = Запрос.Выполнить().Выгрузить();
		
		ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
		ОбластьМакета.Параметры.ТекстЗаголовка = уатОбщегоНазначенияТиповые.уатСформироватьЗаголовокДокумента(ТекущийДокумент, "Слив ГСМ");
		ТабДокумент.Вывести(ОбластьМакета);
		
		ОбластьМакета = Макет.ПолучитьОбласть("РеквизитыОрганизации");
		ОбластьМакета.Параметры.Заполнить(ТЗ[0]);
		ТабДокумент.Вывести(ОбластьМакета);
		
		ОбластьМакета = Макет.ПолучитьОбласть("Подписи");
		ОбластьМакета.Параметры.Ответственный = ТекущийДокумент.Ответственный;
		ТабДокумент.Вывести(ОбластьМакета);
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабДокумент, НомерСтрокиНачало, ОбъектыПечати, ТекущийДокумент);
	КонецЦикла;
	
	ТабДокумент.АвтоМасштаб = Истина;
	
	Возврат ТабДокумент;
	
КонецФункции

#КонецЕсли
